// Задача 14
/*
Каса. Користувачу повідомляють суму, яку йому треба сплатити. Користувач поступово вводить суму грошей до тих пір,
 поки суми не буде достатньо для оплати товарів (кожного разу користувачу повідомляють, яку ще суму потрібно ввести). 
*/
// Крок перший даємо інформацію по кредиту
let creditNum = 10000
alert(`Вам треба погасити ${creditNum} грн`)
// перша проплата
let userPay = parseFloat(prompt("Введіть суму сплати", 11.1))
// проходимо циклом для того щоб перевіряти стан кредиту
step: for (i = 1; ; i++) {
  // умова проплати та перевірка на НаН
  if (!isNaN(userPay)) {
    if (creditNum > userPay) {
      // обновлюємо кредит
      creditNum -= userPay
      // запит на наступну проплату
      userPay = parseFloat(prompt(`Залишилось сплатити ${creditNum}`))
    } else {
      // отримуємо переплату
      const overPay = creditNum - userPay
      alert(
        `Суму сплачено, переплата склала ${Math.abs(overPay).toFixed(2)} грн`
      )
      // виходимо
      break step
    }
  } else {
    // якщо НаН то присвоюємо 0 робимо коректне число
    userPay = 0
    alert("Неправильна сума")
  }
}
