// Задача
/*
З клавіатури вводиться назва категорії водія (А-мотоцикл,
В-легковий автомобіль, С-вантажний автомобіль). Вивести на екран
назву транспортного засобу, яким він може керувати.
*/
let result;
// Крок перший отримати категорію водіння
let driverLisenceCategory = prompt(
  `Введіть(Використовуйте українську розкладку) вашу категорію водійських прав вибір між А В С`,
  `А`
);
// Крок другий судячи з категорії обрати транспортний засіб
switch (driverLisenceCategory) {
  case "А":
    result = `<p>Ви маєте право їздити на А-мотоцикл</p>`;
    break;
  case "В":
    result = `<p>Ви маєте право їздити на В-легковий автомобіль</p>`;
    break;
  case "С":
    result = `<p>Ви маєте право їздити на С-вантажний автомобіль</p>`;
    break;
  default:
    result = `<p>Перевірте правельність введеня та мову котрою вказали категорію повинна бути українська</p>`;
}
// Вивести результат
document.getElementById("b_res").innerHTML = result;
